In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = pd.DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan, np.nan], [0.75, -1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [3]:
df.sum()

one    9.25
two   -5.80
dtype: float64

one    9.25
two   -5.80
dtype: float64

In [4]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [5]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [6]:
df.idxmax()

one    b
two    d
dtype: object

one    b
two    d
dtype: object

In [7]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [8]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [9]:
obj = pd.Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

count     16
unique     3
top        a
freq       8
dtype: object

In [10]:
#conda install pandas-datareader

In [11]:
#import pandas_datareader.data as web

In [12]:
df = pd.DataFrame(np.random.randn(10,4), index = range(10), columns = ['a','b','c','d'])

In [13]:
df

          a         b         c         d
0 -1.438801  0.154664  0.611772  0.167685
1  0.222830 -1.285294 -1.897078  0.120203
2 -0.967671 -0.318742 -0.206650 -0.669741
3 -0.852871  0.460490  0.778004  0.176862
4 -0.105994 -0.943668 -0.359892  2.446587
5 -1.436196 -0.024643  0.556102  0.368761
6 -0.074984 -0.051495  0.516660  0.168158
7  0.041738 -2.128359  0.068874 -3.337207
8  0.538899  0.300888 -1.010650 -0.188639
9 -0.498540  0.516141  2.471618  0.747091

          a         b         c         d
0 -1.438801  0.154664  0.611772  0.167685
1  0.222830 -1.285294 -1.897078  0.120203
2 -0.967671 -0.318742 -0.206650 -0.669741
3 -0.852871  0.460490  0.778004  0.176862
4 -0.105994 -0.943668 -0.359892  2.446587
5 -1.436196 -0.024643  0.556102  0.368761
6 -0.074984 -0.051495  0.516660  0.168158
7  0.041738 -2.128359  0.068874 -3.337207
8  0.538899  0.300888 -1.010650 -0.188639
9 -0.498540  0.516141  2.471618  0.747091

In [14]:
df['a'].corr(df['b'])

-0.40194661418598604

-0.40194661418598604

In [15]:
df['a'].cov(df['b'])

-0.23952623377166615

-0.23952623377166615

In [16]:
df.corr()

          a         b         c         d
a  1.000000 -0.401947 -0.501291 -0.127080
b -0.401947  1.000000  0.508201  0.475865
c -0.501291  0.508201  1.000000  0.091283
d -0.127080  0.475865  0.091283  1.000000

          a         b         c         d
a  1.000000 -0.401947 -0.501291 -0.127080
b -0.401947  1.000000  0.508201  0.475865
c -0.501291  0.508201  1.000000  0.091283
d -0.127080  0.475865  0.091283  1.000000

In [17]:
df.corrwith(df['a'])

a    1.000000
b   -0.401947
c   -0.501291
d   -0.127080
dtype: float64

a    1.000000
b   -0.401947
c   -0.501291
d   -0.127080
dtype: float64

In [18]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [19]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

array(['c', 'a', 'd', 'b'], dtype=object)

In [20]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

c    3
a    3
b    2
d    1
dtype: int64

In [21]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

c    3
a    3
d    1
b    2
dtype: int64

In [22]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [23]:
mask= obj.isin(['b','c'])

In [24]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [25]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

0    c
5    b
6    b
7    c
8    c
dtype: object

In [26]:
to_match = pd.Series(['c','a','b','b','c','a'])
unique_vals = pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [27]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                    'Qu2': [2,3,1,2,3],
                    'Qu3': [1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [28]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0